learning-ws/src/main/resources/Availability/GetRateSwitch/GetRateSwitchTest.xml

<?xml version="1.0" encoding="utf-8"?>
<soap:Envelope xmlns:xsi="http://www.w3.org/2001/XMLSchema-instance" xmlns:xsd="http://www.w3.org/2001/XMLSchema" xmlns:soap="http://schemas.xmlsoap.org/soap/envelope/">
  <soap:Header>
    <KwsSoapHeader xmlns="http://www.shijinet.com.cn/kunlun/kws/1.1/">
      <SessionId>fe376e81-5193-47d2-9683-855e410093ac</SessionId>
      <RetCode></RetCode>
      <ErrReason></ErrReason>
    </KwsSoapHeader>
  </soap:Header>
  <soap:Body>
    <GetRateSwitch xmlns="http://www.shijinet.com.cn/kunlun/kws/1.1/">
      <hotel_code>h001</hotel_code>
      <channel_code>CRO</channel_code>
      <rate_code>DAY</rate_code>
      <year>2010</year>
    </GetRateSwitch>
  </soap:Body>
</soap:Envelope>